# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне

frut = ['яблоко', 'банан', 'киви', 'арбуз']
r = 1
for bag in frut:
    print(r, bag)
    r += 1


